# Создать телефонный справочник с возможностью импорта и экспорта данных в нескольких форматах.
# Продолжить работу над справочником.
# Что можно добавить:
# - почистить архитектуру
# - добавить разные форматы для телефонной книги
# - добавить логер
# - добивать интерфейс

# 1. +Добавить структуру сохранения в отдельные папки + добавить еще один формат файла+
# 2. +Объединить модули в пакеты+
# 3. Добавить возможность поиска всех возможных вариантов при дублях
# 4. +Добавить ID записи+
# 5. +Добавить логгер+

import gui
